
[sep11:log]
TRANSFORMS-sub_sourcetype_sep11_file =  force_sourcetype_sep11_agent,force_sourcetype_sep11_traffic, force_sourcetype_sep11_proactive, force_sourcetype_sep11_behavior,force_sourcetype_sep11_risk,force_sourcetype_sep11_admin,force_sourcetype_sep11_policy,force_sourcetype_sep11_agt_system, force_sourcetype_sep11_scan,force_sourcetype_sep11_security, force_sourcetype_sep11_scm_system

## .tmp transforms are for file-based data
[sourcetype::...smc_admin.tmp]
sourcetype = sep11:admin
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...smc_agent_act.tmp]
sourcetype = sep11:agent
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...smc_policy.tmp]
sourcetype = sep11:policy
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_behavior.tmp]
sourcetype = sep11:behavior
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_proactive.tmp]
sourcetype = sep11:proactive
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_packet.tmp]
sourcetype = sep11:packet
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_risk.tmp]
sourcetype = sep11:risk
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_scan.tmp]
sourcetype = sep11:scan
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_security.tmp]
sourcetype = sep11:ids
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_system.tmp]
sourcetype = sep11:agt_system
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...scm_system.tmp]
sourcetype = sep11:scm_system
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

[sourcetype::...agt_traffic.tmp]
sourcetype = sep11:traffic
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d%n%%H:%M%S

## sep transform is for syslog
[sep11]
TRANSFORMS-sub_sourcetype_sep =  force_sourcetype_sep11_traffic, force_sourcetype_sep11_proactive, force_sourcetype_sep11_behavior,force_sourcetype_sep11_risk,force_sourcetype_sep11_admin,force_sourcetype_sep11_agent,force_sourcetype_sep11_policy,force_sourcetype_sep11_agt_system, force_sourcetype_sep11_scan,force_sourcetype_sep11_security, force_sourcetype_sep11_scm_system


###### SEP Admin ######
[sep11:admin]

KV_MODE = none
#There are few fields and they are all manually extracted anyway - not using CSV header.
## Transforms still exist though
#REPORT-0-csv_header_for_sep11_admin = message_for_sep11_log_files, message_for_sep11_syslog
#REPORT-1-csv_header_for_sep11_admin = csv_header_for_sep11_admin
FIELDALIAS-bestmatch_from_dvc_for_sep11_admin = dvc_nt_host as dest_nt_host, dvc_nt_host as dest, dvc_nt_host as src_nt_host, dvc_nt_host as src
REPORT-dest_nt_host_for_sep11_admin = dest_nt_host_for_sep11_admin
REPORT-domain_for_sep11_admin = dest_nt_domain_for_sep11_all
REPORT-dvc_nt_host_for_sep11_admin = dvc_nt_host_for_sep11_all
FIELDALIAS-name_for_sep11_admin = signature as name
FIELDALIAS-src_nt_domain_for_sep11_admin = dest_nt_domain as src_nt_domain
REPORT-user_for_sep11_admin = user_for_sep11_admin
LOOKUP-vendor_info_for_sep11_admin = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Agent ######
[sep11:agent]

KV_MODE = none
REPORT-0-csv_header_for_sep11_agent = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_agent = csv_header_for_sep11_agent
FIELDALIAS-dest_for_sep11_agent = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
FIELDALIAS-dvc_for_sep11_agent = dvc_nt_host as dvc
REPORT-dvc_nt_host_for_sep11_agent = dvc_nt_host_for_sep11_all
REPORT-addresses_inbound_outbound_for_sep11_agent = src_dest_addr_inbound_for_sep11_agent, src_dest_addr_outbound_for_sep11_agent
REPORT-exclamation_fields_for_sep11_agent = exclamation_fields_for_sep11_agent
REPORT-times_for_sep11_agent = begin_time_for_sep11_agent, end_time_for_sep11_agent
REPORT-info_for_sep11_agent = occurrences_for_sep11_agent, application_for_sep11_agent, location_for_sep11_agent, user_for_sep11_agent, domain_for_sep11_agent
FIELDALIAS-src_nt_domain_for_sep11_agent = dest_nt_domain as src_nt_domain
LOOKUP-vendor_info_for_sep11_agent = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP AGT System ######
[sep11:agt_system]

KV_MODE = none
REPORT-0-csv_header_for_sep11_agt_system = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_agt_system = csv_header_for_sep11_agt_system
FIELDALIAS-bestmatch_for_sep11_agt_system = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
FIELDALIAS-dvc_for_sep11_agt_system = dvc_ip as dvc
REPORT-name_dvc_ip_for_sep11_agt_system = name_dvc_ip_for_sep11_agt_system
REPORT-product_version_for_sep11_agt_system = product_version_for_sep11_agt_system
REPORT-sig_version_for_sep11_agt_system = sig_version_for_sep11_agt_system
REPORT-version_for_sep11_agt_system = version_for_sep11_agt_system
REPORT-category_for_sep11_agt_system = category_for_sep11_agt_system
LOOKUP-vendor_info_for_sep11_agt_system= sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Behavior ######
[sep11:behavior]

KV_MODE = none
REPORT-0-csv_header_for_sep11_behavior = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_behavior = csv_header_for_sep11_behavior
REPORT-dest_nt_domain_for_sep11_behavior = dest_nt_domain_for_sep11_all
REPORT-file_name_path_for_sep11_behavior = file_name_path_for_sep11_behavior
REPORT-signature_for_sep11_behavior = signature_for_sep11_behavior
FIELDALIAS-src_nt_domain_for_sep11_behavior = dest_nt_domain as src_nt_domain
FIELDALIAS-src_nt_host_for_sep11_behavior = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-user_for_sep11_behavior = user_for_sep11_all
LOOKUP-vendor_info_for_sep11_behavior = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product,ids_type


###### SEP IDS ######
[sep11:ids]

KV_MODE = none
REPORT-0-csv_header_for_sep11_security = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_security = csv_header_for_sep11_security
REPORT-addresses_inbound_outbound_for_sep11_security = src_dest_addr_inbound_for_sep11_security, src_dest_addr_outbound_for_sep11_security
REPORT-action_for_sep11_security = action_for_sep11_security
REPORT-application_file_for_sep11_security = application_file_for_sep11_security
FIELDALIAS-bestmatch_for_sep11_security = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-dest_nt_domain_for_sep11_security = dest_nt_domain_for_sep11_all
REPORT-signature_for_sep11_security = sep11_name_as_signature
REPORT-exclamation_fields_for_sep11_ids = exclamation_fields_for_sep11_ids
FIELDALIAS-src_domain_for_sep11_security = dest_nt_domain as src_nt_domain
REPORT-user_for_sep11_ids = user_for_sep11_all
LOOKUP-vendor_info_for_sep11_security = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product,ids_type


###### SEP Policy ######
[sep11:policy]
KV_MODE = none

REPORT-0-csv_header_for_sep11_policy = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_policy = csv_header_for_sep11_policy
REPORT-action_success_for_sep11_policy = action_success_for_sep11_policy
FIELDALIAS-bestmatch_from_dvc_for_sep11_policy = dvc_nt_host as dest_nt_host, dvc_nt_host as dest, dvc_nt_host as src_nt_host, dvc_nt_host as src
REPORT-command_for_sep11_policy = command_for_sep11_policy
REPORT-dest_nt_domain_for_sep11_policy = dest_nt_domain_for_sep11_all
REPORT-dvc_nt_host_for_sep11_policy = dvc_nt_host_for_sep11_all
FIELDALIAS-src_nt_domain_for_sep11_policy = dest_nt_domain as src_nt_domain
REPORT-user_for_sep11_policy = user_for_sep11_policy
LOOKUP-vendor_info_for_sep11_policy = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Proactive ######
[sep11:proactive]

KV_MODE = none
REPORT-0-csv_header_for_sep11_proactive = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_proactive = csv_header_for_sep11_proactive
LOOKUP-action_for_sep11_proactive = sep11_action_lookup actual_action OUTPUT action
REPORT-actions_taken_for_sep11_proactive = actual_action_for_sep11_risk,requested_action_for_sep11_risk,secondary_action_for_sep11_risk	
REPORT-application_info_for_sep11_proactive = application_name_for_sep11_proactive, application_type_for_sep11_proactive, application_version_for_sep11_proactive
REPORT-detections_for_sep11_proactive = detection_type_for_sep11_proactive, detection_score_for_sep11_proactive
REPORT-file_data_for_sep11_proactive = hash_type_for_sep11_proactive,hash_value_for_sep11_proactive,file_size_for_sep11_proactive
FIELDALIAS-bestmatch_for_sep11_proactive = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-dest_nt_host_for_sep11_proactive = dest_nt_host_for_sep11_all
REPORT-web_info_for_sep11_proactive = download_site_for_sep11_risk,web_domain_for_sep11_risk,downloaded_by_for_sep11_risk,url_tracking_status_for_sep11_risk
REPORT-requested_action_for_sep11_proactive = requested_action_for_sep11_risk
REPORT-secondary_action_for_sep11_proactive = secondary_action_for_sep11_risk
REPORT-info_for_sep11_proactive = user_for_sep11_all, computer_name_for_sep11_proactive, company_name_for_sep11_proactive
REPORT-other_info_for_sep11_proactive = disposition_for_sep11_risk,prevalence_for_sep11_risk,confidence_for_sep11_risk, first_seen_for_sep11_risk

LOOKUP-vendor_info_for_sep11_proactive = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Risk ######
[sep11:risk]
KV_MODE = none
REPORT-0-csv_header_for_sep11_risk = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-extract_fields = risk_type_for_sep11_risk, scan_type_for_sep11_risk
REPORT-dest_nt_host_for_sep11_risk = dest_nt_host_for_sep11_all
REPORT-dest_nt_domain_for_sep11_risk = dest_nt_domain_for_sep11_all
REPORT-group_name_for_sep11_risk = group_name_for_sep11_all
REPORT-user_for_sep11_risk = user_for_sep11_all
REPORT-occurrences_for_sep11_risk = occurrences_for_sep11_risk
REPORT-dest_ip_for_sep11_risk = dest_ip_for_sep11_risk
REPORT-process_for_sep11_risk = process_for_sep11_risk
REPORT-file_name_path_for_sep11_risk = file_name_path_for_sep11_risk
REPORT-signature_for_sep11_risk = signature_for_sep11_risk
REPORT-file_data_for_sep11_risk = hash_type_for_sep11_risk,hash_value_for_sep11_risk,file_size_for_sep11_risk
REPORT-times_for_sep11_risk = event_time_for_sep11_risk,insert_time_for_sep11_risk,end_time_for_sep11_risk,last_update_time_for_sep11_risk
REPORT-actions_taken_for_sep11_risk = actual_action_for_sep11_risk,requested_action_for_sep11_risk,secondary_action_for_sep11_risk	
REPORT-web_info_for_sep11_risk = download_site_for_sep11_risk,web_domain_for_sep11_risk,downloaded_by_for_sep11_risk,url_tracking_status_for_sep11_risk
REPORT-other_info_for_sep11_risk = disposition_for_sep11_risk,prevalence_for_sep11_risk,confidence_for_sep11_risk, first_seen_for_sep11_risk
FIELDALIAS-bestmatch_for_sep11_risk = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
LOOKUP-action_for_sep11_risk = sep11_action_lookup actual_action OUTPUTNEW action
LOOKUP-vendor_info_for_sep11_risk = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product


###### SEP Scan ######
[sep11:scan]

KV_MODE = none
REPORT-0-csv_header_for_sep11_scan = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_scan = csv_header_for_sep11_scan
FIELDALIAS-bestmatch_for_sep11_scan = dest_nt_host as dest, dest_nt_host as src_nt_host, dest_nt_host as src
REPORT-counts_for_sep11_scan = infected_count_for_sep11_scan, threat_count_for_sep11_scan, total_file_count_for_sep11_scan
REPORT-times_for_sep11_scan = begin_time_for_sep11_scan, end_time_for_sep11_scan
REPORT-dest_nt_host_for_sep11_scan = dest_nt_host_for_sep11_scan
REPORT-dest_ip_for_sep11_scan = dest_ip_for_sep11_scan
REPORT-dest_nt_domain_for_sep11_scan = dest_nt_domain_for_sep11_all
REPORT-duration_for_sep11_scan = duration_for_sep11_scan
REPORT-group_name_for_sep11_scan = group_name_for_sep11_all
FIELDALIAS-src_nt_domain_for_sep11_scan = dest_nt_domain as src_nt_domain
FIELDALIAS-src_ip_for_sep11_scan = dest_ip as src_ip
LOOKUP-vendor_info_for_sep11_scan = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product

REPORT-Xdest_ip_for_sep11_scan = dest_ip_for_sep11_scan
REPORT-Xuser_for_sep11_scan = user_for_sep11_scan 


###### SEP SCM System ######
[sep11:scm_system]

KV_MODE = none
REPORT-0-csv_header_for_sep11_scm_system = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_scm_system = csv_header_for_sep11_scm_system
FIELDALIAS-dvc_for_sep11_scm_system = dvc_nt_host as dvc
REPORT-dest_nt_domain_for_sep11_scm_system = dest_nt_domain_for_sep11_all
LOOKUP-vendor_info_for_sep11_scm_system = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product
REPORT-version_for_sep11_scm_system = version_for_sep11_scm_system


###### SEP Traffic ######
[sep11:traffic]

KV_MODE = none
REPORT-0-csv_header_for_sep11_traffic = message_for_sep11_log_files, message_for_sep11_syslog
REPORT-1-csv_header_for_sep11_traffic = csv_header_for_sep11_traffic
LOOKUP-action_for_sep11_traffic = sep11_action_lookup vendor_action OUTPUTNEW action
REPORT-vendor_action_for_sep11_traffic = vendor_action_for_sep11_traffic
REPORT-addresses_for_sep11_traffic = inbound_addresses_for_sep11_traffic, outbound_addresses_for_sep11_traffic
FIELDALIAS-dest_for_sep11_traffic = dest_nt_host as dest
LOOKUP-direction_for_sep11_traffic = sep11_direction_lookup vendor_direction OUTPUTNEW direction
REPORT-nt_host_for_sep11_traffic = dest_nt_host_inbound_for_sep11_traffic, src_nt_host_outbound_for_sep11_traffic
FIELDALIAS-src_for_sep11_traffic = src_nt_host as src
REPORT-user_for_sep11_traffic = user_for_sep11_all
LOOKUP-vendor_info_for_sep11_traffic = sep11_vendor_info_lookup sourcetype OUTPUT vendor,product

###### SEP Antivirus ######
#[sep11:antivirus]
#KV_MODE = none
#REPORT-0-csv_header_for_sep11_antivirus = message_for_sep11_log_files, message_for_sep11_syslog
#REPORT-1-csv_header_for_sep11_antivirus = csv_header_for_sep11_antivirus
#REPORT-category_for_sep11_antivirus = category_for_sep11_antivirus
#FIELDALIAS-dest_for_sep11_antivirus = dest_nt_host as dest

