#-MyH Modified all regex to detect firewall type 6/5/2015

[force_sourcetype_for_cisco_asa]
DEST_KEY = MetaData:Sourcetype
#REGEX = %ASA-\d-\d{6}
REGEX = %ASA-
FORMAT = sourcetype::cisco:asa

[force_sourcetype_for_cisco_fwsm]
DEST_KEY = MetaData:Sourcetype
#REGEX = %FWSM-\d-\d{6}
REGEX = %FWSM-
FORMAT = sourcetype::cisco:fwsm

[force_sourcetype_for_cisco_pix]
DEST_KEY = MetaData:Sourcetype
#REGEX = %PIX-\d-\d{6}
REGEX = %PIX-
FORMAT = sourcetype::cisco:pix

[transport_for_cisco]
REGEX = (TCP|tcp|UDP|udp|ICMP|icmp)
FORMAT = transport::$1

[cisco_eventinfo]
REGEX = %[\w-]+(\d)-(\d{6})
FORMAT = log_level::$1 message_id::$2

[user_for_cisco]
REGEX = [Uu]ser\s["|']([^'"]*)["|']
FORMAT = user::$1

[uname_for_cisco]
REGEX = \sUname:\s(.*)
FORMAT = user::$1

[cisco_bytes_in]
REGEX=bytes\s(\d*)
FORMAT=bytes_in::$1

[direction_for_cisco]
REGEX = ([i|I]nbound|[O|o]utbound)
FORMAT = direction::$1

[reverse_src_dest_for_outbound]
REGEX = [Oo]utbound\s+\S+\s+connection\s+\d+\s+for\s+\S+\s*:\s*([^\s\/\(]+)(?:\/(\w+))?(?:\((\S+)\))?\s*\(?([^\s\/\(]+)?\/?(\d+)?\)?\s+to\s+[^:]+:\s*([^\s\/\(]+)(?:\/(\w+))?(?:\((\S+)\))?\s*\(?([^\s\/\(]+)?\/?(\d+)?\)?
FORMAT = dest_ip::$1 dest_port::$2 dest_user::$3 dest_translated_ip::$4 dest_translated_port::$5 src_ip::$6 src_port::$7 src_user::$8 src_translated_ip::$9 src_translated_port::$10

[icmp_type_icmp_code_rule_type_for_cisco]
REGEX = (?:\(type\s([^,]+),\scode\s([^\)]+)\))?\s+by\s+access-group\s+"+([^"]+)
FORMAT = icmp_type::$1 icmp_code::$2 rule_number::$3

[icmp_type_icmp_code_rule_type_for_cisco_1]
REGEX = (?i)icmp\s*type=(\d+)
FORMAT = icmp_type::$1

[cisco_dvc1]
REGEX=(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}).*%ASA
FORMAT=dvc::$1

[cisco_dvc2]
REGEX=\s\d{2}:\d{2}:\d{2}\s([^ ]+)
FORMAT=dvc::$1

[cisco_source_ipv4]
REGEX = \s+(?:from|for|src(?! user)) (?:([\w\-_]+):)?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})(?:\/(\w+))?(?:\((\S+)\))?\s*\(?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})?\/?(\d+)?\)?\s*(?:\((?:([\w^\\]+)\\)?([\w\-_]+)\))?
FORMAT = src_interface::$1 src_ip::$2 src_port::$3 src_user::$4 src_translated_ip::$5 src_translated_port::$6 src_nt_domain::$7 src_user::$8

[cisco_source_ipv6]
REGEX = \s+(?:from|for|src(?! user)) (?:([\w-_]+):)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)(?:/(\S+))?\s*
FORMAT = src_interface::$1 src_ipv6::$2 src_port::$22

[cisco_translated_source_ipv6]
REGEX = (([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)/(\d+)\)\s(to|dst)\s
FORMAT = src_translated_ip::$1 src_translated_port::$21

[cisco_destination_ipv4]
REGEX = \s+(?:to|dst(?! user)) (?:([\w-_]+):)?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})(?:/(\d+))?\s*\(?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})?/?([\w\d]+)?\)?(?:\((\S+)\))?
FORMAT = dest_interface::$1 dest_ip::$2 dest_port::$3 dest_translated_ip::$4 dest_translated_port::$5 dest_user::$6

[cisco_from_to_ipv4]
REGEX = \s(?:for|from|src)\s+(?:([^:]+):)?([\d\.]+)/(\d+)\s+(?:to|dst)\s+(?:([^:]+):)?([\d\.]+)/(\w+)\s+
FORMAT = src_interface::$1 src_ip::$2 src_port::$3 dest_interface::$4 dest_ip::$5 dest_port::$6

[cisco_destination_ipv4_1]
REGEX = \s+[Aa]ddress\s*(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})(?:/(\d+))?\s*[Dd]iscovered\s*for\s*domain\s*([\S]+)
FORMAT = dest_ip::$1 dest_port::$2 dest_nt_domain::$3

[cisco_destination_ipv6]
REGEX = \s+(?:to|dst(?! user)) (?:([\w-_]+):)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)(?:/(\S+))?\s*
FORMAT = dest_interface::$1 dest_ipv6::$2 dest_port::$22

[cisco_translated_destination_ipv6]
REGEX = \s(?:to|dest)\s(?:[a-f|A-F|0-9|:]+)(?:/\S+)?\s*\((([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)(?:/(\S+))?\)
FORMAT = dest_translated_ip::$1 dest_translated_port::$21

[cisco_foreign_addr_port_ipv4]
REGEX = \sfaddr (?:([\w\-_]+):)?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})(?:\/(\d+))?\s*(?:\((?:([^\\]+)\\)?([^\)]+)\))?
FORMAT = dest_interface::$1 dest_ip::$2 dest_port::$3 dest_nt_domain::$4 dest_user::$5

[cisco_foreign_addr_port_ipv6]
REGEX = \sfaddr\s(?:([\w-_]+):)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)/?(\d*)
FORMAT = dest_interface::$1 dest_ipv6::$2 dest_port::$22

[cisco_local_addr_port_ipv4]
REGEX = \sladdr (?:([\w-_]+):)?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})(?:/(\S+))?\s*
FORMAT = src_interface::$1 src_ip::$2 src_port::$3

[cisco_local_addr_port_ipv6]
REGEX = \sladdr\s(?:([\w-_]+):)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)/?(\d*)
FORMAT = src_interface::$1 src_ipv6::$2 src_port::$22

[cisco_src_dest_ipv4]
REGEX =  (?:([\w-_]+)/)?(\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})\((\d*)\)\s\->\s(?:([\w-_]+)/)?(\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})\((\d*)\)
FORMAT = src_interface::$1 src_ip::$2 src_port::$3 dest_interface::$4 dest_ip::$5 dest_port::$6

[cisco_src_ipv6]
REGEX = \s(?:([\w-_]+)/)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)\((\d*)\)\s\->\s
FORMAT = src_interface::$1 src_ipv6::$2 src_port::$22

[cisco_dest_ipv6]
REGEX = \s\->\s(?:([\w-_]+)/)?(([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:([0-9A-Fa-f]{1,4}:[0-9A-Fa-f]{0,4}|:[0-9A-Fa-f]{1,4})?|(:[0-9A-Fa-f]{1,4}){0,2})|(:[0-9A-Fa-f]{1,4}){0,3})|(:[0-9A-Fa-f]{1,4}){0,4})|:(:[0-9A-Fa-f]{1,4}){0,5})((:[0-9A-Fa-f]{1,4}){2}|:(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])(\.(25[0-5]|(2[0-4]|1[0-9]|[1-9])?[0-9])){3})|(([0-9A-Fa-f]{1,4}:){1,6}|:):[0-9A-Fa-f]{0,4}|([0-9A-Fa-f]{1,4}:){7}:)\((\d*)\)
FORMAT = dest_interface::$1 dest_ipv6::$2 dest_port::$22

[cisco_asa_intrusion_signature]
REGEX = %ASA-\d-400\d+\sIPS:(\d{4})\s(.*)\sfrom
FORMAT = signature_id::$1 signature::$2

[cisco_acl]
REGEX = access[\s-]group\s[\("]?(?<acl>[^\s"\)]+)

[cisco_asa_web]
REGEX = (\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})\s+(\S+)\s+(?:url|URL)\s+(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})\s*:\s*(\S*)
FORMAT = src_ip::$1 vendor_action::$2 dest_ip::$3 url::$4

[cisco_asa_vendor_severity]
REGEX = threat-level\s*:\s*([^\s,]+)
FORMAT = vendor_severity::$1

[cisco_asa_vendor_category]
REGEX = category\s*:\s*([^\s,]+)
FORMAT = vendor_category::$1

[cisco_pix_intrusion_signature]
REGEX = %PIX-\d-400\d+\sIDS:(\d{4})\s(.*)\sfrom
FORMAT = signature_id::$1 signature::$2

[cisco_action_success_for_auth]
REGEX=([Aa]uthentication [Ss]ucceeded|[Aa]uthorization [Pp]ermitted|authentication Successful|passed authentication|Login permitted)
FORMAT=vendor_action::$1

[cisco_action_failure_for_auth]
REGEX = (Authentication failed|Authorization denied|Can't find authorization|Authentication Failed|authentication Rejected|credentials rejected|Authentication:Dropping|login warning|login failed|failed authentication)
FORMAT = vendor_action::$1

[cisco_action_blocked]
REGEX=([Cc]onnection denied|Deny inbound|Deny|Terminating|action locally|Unable to Pre-allocate|denied\s[tcp|udp|icmp]+|discarded|access denied|Dropped|Dropping)
FORMAT=vendor_action::$1

[cisco_action_allowed]
REGEX=([B|b]uilt|[pP]ermitted|whitelisted|Pre-allocated|Rebuilt|access requested|access permitted)
FORMAT=vendor_action::$1

[cisco_action_unknown]
REGEX = (redirected|limit exceeded)
FORMAT = vendor_action::$1

[cisco_action_teardown]
REGEX = (Teardown\s[A-Z]{3,4})\sconnection
FORMAT = vendor_action::$1

[cisco_fw_msg]
REGEX = %ASA-\d-\d+: (.+)
FORMAT = msg::$1

[cisco_fw_connection]
REGEX = \sconnection (\d+)
FORMAT = session_id::$1

[cisco_fw_access-list]
REGEX = access-list ([^\s]+)
FORMAT = rule::$1

[cisco_fw_duration]
REGEX = [Dd]uration:?\s*(?:(\d+)[dD])?\s*(\d+)[Hh]?:(\d+)[Mm]?:(\d+)[Ss]?
FORMAT = duration_day::$1 duration_hour::$2 duration_minute::$3 duration_second::$4

# VPN
[cisco_fw_group]
REGEX = [Gg]roup\s+(?:=\s+)?([^\s,]+)
FORMAT = group::$1

[cisco_fw_user]
REGEX = User <(\S+)>
FORMAT = user::$1

[cisco_fw_ip]
REGEX = IP <(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})>
FORMAT = src_ip::$1

[cisco_fw_722]
REGEX = [Tt]unnel[Gg]roup\s+(?:=\s+)?([^\s,]+)
FORMAT = tunnelgroup::$1

[cisco_fw_disconnect]
REGEX = Bytes xmt: (?<bytes_out>\d+), Bytes rcv: (?<bytes_in>\d+), Reason: (?<reason>.+)

[cisco_fw_authentication_action]
REGEX = Authentication: (?<vendor_action>\S+),

[cisco_fw_session_type]
REGEX = Session Type: (?<type>\S+),

[cisco_fw_user-identity]
REGEX = user-identity: (?<method>Add|Delete) (\S+) mapping (?<src_ip>\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3}) - (?<user>\S+) (?<vendor_action>\S+) - (?<reason>.+)

[cisco_fw_assigned_ip]
REGEX = [Aa]ddress\s\<?(\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})\>?\s
FORMAT = assigned_ip::$1

[cisco_fw_dap]
REGEX = DAP: User (?<user>\S+), Addr (?<src_ip>\d{1,3}\.\d{1,3}.\d{1,3}.\d{1,3})

[cisco_fw_dap_2]
REGEX = Connection (?<type>\S+), (?<dap_message>.+)

[cisco_fw_kv_1]
REGEX = acl\s*=\s*([^,][^\s\)]+)
FORMAT = acl::$1

[cisco_fw_kv_2]
REGEX = [gG]roup\s*=\s*([^,][^\s\)]+)
FORMAT = group::$1

[cisco_fw_kv_3]
REGEX = ([uU]sername|[uU]ser)\s*=\s*([^,][^\s\)]+)
FORMAT = user::$1

[cisco_fw_kv_4]
REGEX = msgid\s*=\s*([^,][^\s\)]+)
FORMAT = msgid::$1

# LOOKUPS
[cisco_asa_intrusion_severity_lookup]
filename = cisco_asa_severity_lookup.csv

[cisco_asa_ids_lookup]
filename = cisco_asa_ids_lookup.csv

[cisco_action_lookup]
filename = cisco_action_lookup.csv
case_sensitive_match = false

[cisco_asa_vendor_class_lookup]
filename = cisco_asa_vendor_class_lookup.csv
match_type = WILDCARD(message_id)

[cisco_asa_change_analysis_lookup]
filename = cisco_asa_change_analysis_lookup.csv
match_type = WILDCARD(message_id)

[cisco_asa_syslog_severity_lookup]
filename = cisco_asa_syslog_severity_lookup.csv
